
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"622cae6e6a32f9f7ed5e4f6fef23f01deb9d6b7c9e3a3397c7ab554b49d56c43\"" -> "W/\"bba32ad327950937a4f490e7499580d5ffd631a4ed721b19c00904e4939681a4\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"bdcc7e42abcbfd7fa123a68ec7cbaa8babbaa30d5a44e65a2d93b4f71b8ca9c6\"" -> "W/\"0d2a89b303d211b5b144c4d836bc52dd749ae4ee99d3e81135e42129a94a703f\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e615cb3ae05dfb775ab9a43fdd5119db918c61d8f339f16d90e940fff2fb3809\"" -> "W/\"a708061c027147e489f8beba656baa93e4c78fe24914db976c9f0c3e8da2f8fe\""
        id                          = "template-template"
        name                        = "template-template"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"9776c23f1c0a04dd73bf1fbc281a657a6a47c9050b810798c74d8990f247a6f3\"" -> "W/\"7e9efe768017ef234fa65791c56ce75a6fb881472739fe0b969398fc60088844\""
        id          = "1252074"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7206e61f6a30795ccab4c318a297116389e0d5017486e96e0a6d60f4d2ea3b0f\"" -> "W/\"4674580755836f81434dca7057418acb391c90daeaa4d3d1ca325bac84395ce5\""
        id          = "1259734"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"02d88ef68a44c8555f13b15a2c682f2bc1bfa75ea961dffdfca648bffa6dc25d\"" -> "W/\"5c00040588031686de57d61d5ba1f5a121cd84aab5472cf268fb3d9211d3b1b4\""
        id          = "1260235"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"593b6acabadb26b591d3cacfbf0172f9c526f3c7d29a4e6f73fd9d12b758d340\"" -> "W/\"64861abdeb73d6211b278e054c9658e25fd8b37fa7231c86b8d5f2329d707c8c\""
        id          = "1252075"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"04a393c1561b23786287f9bc32693d2483d7f255777a6390eec1f219c12f2253\"" -> "W/\"7b0e1bb6ccc5432ce17f51293ab64a7f1471cf391c7d7725a1670eb8da9850f2\""
        id          = "1252077"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"fbee0994d0434e257d7ef0d69a9414c009ef463bcf71dab29a3a1f7372f17934\"" -> "W/\"acdb5da78f167bc41632103882c076d6f0487607971f75212779ee8b331ef465\""
        id          = "1252076"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"10b8bd6506170286d5fe9dc98b5cc52dd2a63fdaade0153f568b28e26fa2ad2e\"" -> "W/\"522e343ac83b22d9cd318ec46e820a6c2108bd1019090cdb45e5bc69231bdca7\""
        id          = "1252078"
        name        = "protect-main-branch-terraform-github-pre-commit"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"111db42569466cec0f16e76b1ddb47e59e393ee18891bc52c74fbca3bc79d86d\"" -> "W/\"fdcecfc8ddf5a0fca19005b58b83d68dc8972f6a84492895c67b15383e3e0592\""
        id          = "1260238"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"3051a9044ac24fde873294a92acc27496a9859827e5e7e21f2a5c175fcc49d62\"" -> "W/\"62b98bf71c10179537fc51da776df4bbcb0cef7ab0b1d10a016b647581846697\""
        id          = "1260237"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"afd1912ee4da0d8ca011000fde4889d0262178f3ae97cdd696ccd0e758363e76\"" -> "W/\"4b7fc0c751f7af4d0b414133f400fdc3393d84a88b960bee82eca0bbee4dd424\""
        id          = "1260236"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"c534b259d3b2766e0ee79927f857ed94ca6d58bd1f32e5b507628d55c3a904d1\"" -> "W/\"0630aa6fff09042b29b9590fec9c6479dc075decd8b61434ff2e17cbeacddabe\""
        id          = "1252079"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"df05ae0f4bd0c50799fdb096d742a77ae379daf2b2c688b461c1ad3a80ce0ae4\"" -> "W/\"b322560564f9c574dfd7e4e898e15f5dd14897778a8598e2b4d421aa81b385f2\""
        id          = "1252080"
        name        = "protect-main-branch-terraform-github-terraform-plan"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.settings_all["kong-development"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-development"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->